trade_exp/src/Catalogs/ПрайсыКлиентов/ПрайсыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="13978a58-47a7-4efa-af39-0f6578b54b04">
  <name>ПрайсыКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ab855257-8414-4c76-8fc1-5eb24736a914">
    <name>ИДГруппыПользователей</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6da46992-8333-447b-8def-094c687ca25b">
    <name>НаименованиеЦены</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2d274792-0174-4ee8-9f34-a99bb0e0e4df">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7c8d2cdd-de4b-474e-9024-0ba0d7f1f310">
    <name>СегментПартнеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3161a031-737b-4632-a5d4-0abe600c1d96">
    <name>Выгружать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="e2a9a75d-5cc2-4ad4-9790-fa0aa530066f">
    <name>Клиенты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8c5f1e90-887f-46d1-ba78-b14ffb58cb28">
      <name>Клиент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/ПрайсыКлиентов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.ИДГруппыПользователей.Доступность= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрайсыКлиентов.Ссылка,
	|	ПрайсыКлиентов.НаименованиеЦены,
	|	ПрайсыКлиентов.Наименование
	|ИЗ
	|	Справочник.ПрайсыКлиентов КАК ПрайсыКлиентов
	|ГДЕ
	|	ПрайсыКлиентов.Ссылка <> &Ссылка
	|	И ПрайсыКлиентов.НаименованиеЦены = &НаименованиеЦены";
	
	Запрос.УстановитьПараметр("НаименованиеЦены", Объект.НаименованиеЦены);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Отказ= Истина;
		Сообщение= Новый СообщениеПользователю;
		Сообщение.Текст= "Прайс с таким названием цены уже существует! ("+ВыборкаДетальныеЗаписи.Наименование+")";
		Сообщение.КлючДанных= ВыборкаДетальныеЗаписи.Ссылка;
		Сообщение.Сообщить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Клиенты.Клиент
	|ПОМЕСТИТЬ КлиентыЭтойГруппы
	|ИЗ
	|	&Клиенты КАК Клиенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрайсыКлиентовКлиенты.Клиент,
	|	ПрайсыКлиентовКлиенты.Ссылка
	|ПОМЕСТИТЬ КлиентыВДругихГруппах
	|ИЗ
	|	Справочник.ПрайсыКлиентов.Клиенты КАК ПрайсыКлиентовКлиенты
	|ГДЕ
	|	ПрайсыКлиентовКлиенты.Ссылка <> &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлиентыВДругихГруппах.Клиент,
	|	КлиентыВДругихГруппах.Ссылка,
	|	КлиентыВДругихГруппах.Ссылка.Наименование КАК Наименование
	|ИЗ
	|	КлиентыЭтойГруппы КАК КлиентыЭтойГруппы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КлиентыВДругихГруппах КАК КлиентыВДругихГруппах
	|		ПО КлиентыЭтойГруппы.Клиент = КлиентыВДругихГруппах.Клиент";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Клиенты", Объект.Клиенты.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Отказ= Истина;
		Сообщение= Новый СообщениеПользователю;
		Сообщение.Текст= "Клиент '"+ВыборкаДетальныеЗаписи.Клиент+"' присутствует в другом прайсе! ("+ВыборкаДетальныеЗаписи.Наименование+")";
		Сообщение.КлючДанных= ВыборкаДетальныеЗаписи.Ссылка;
		Сообщение.Сообщить();
	КонецЦикла;

КонецПроцедуры
